### 분석 실습

#### 타이타닉 생존자 예측모델 개발 및 평가(아래 사항들 반영 필수)
- Titanic data 전처리
    - 분석 데이터 : titanic3.csv
    - 재사용 가능한 전처리 사용자 함수 작성 하여 일괄 전처리 Null 값 처리
    - 탐색적 분석을 통한 변수 선정 및 파생변수 생성 
    - 훈련 데이터 : 검증 데이터 = 8:2
    - 분류모델 : Decision Tree, Random Forest, Logistic Regression 3개 모두 적용
    - 평가 : 사이킷런 metrics 사용, 다음 항목들을 포함하는 사용자 함수 def get_clf_eval(y_test, pred)을 작성하여 일괄 처리
    \
    confusion_matrix, accuracy_score, precision_score, recall_score, f1_score
    - 모델 개발 및 평가 결과에 대한 종합 의견


- 컬럼 정보
    - survived : 생존여부(1: 생존, 0 : 사망)
    - pclass : 승선권 클래스(1 : 1st, 2 : 2nd ,3 : 3rd)
    - name : 승객 이름
    - sex : 승객 성별
    - age : 승객 나이
    - sibsp : 동반한 형제자매, 배우자 수
    - parch : 동반한 부모, 자식 수
    - ticket : 티켓의 고유 넘버
    - fare 티켓의 요금
    - cabin : 객실 번호
    - embarked : 승선한 항구명(C : Cherbourg, Q : Queenstown, S : Southampton)
    - boat
    - body
    - home.dest

## 1. 탐색적 분석

In [2]:
import seaborn as sns
import pandas as pd

titanic=pd.read_csv('titanic3.csv')
titanic.head(20)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48.00,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.00,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.00,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.00,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.00,0,0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"
10,1,0,"Astor, Col. John Jacob",male,47.00,1,0,PC 17757,227.5250,C62 C64,C,NaN,124.0,"New York, NY"
11,1,1,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18.00,1,0,PC 17757,227.5250,C62 C64,C,4,NaN,"New York, NY"
12,1,1,"Aubart, Mme. Leontine Pauline",female,24.00,0,0,PC 17477,69.3000,B35,C,9,NaN,"Paris, France"
13,1,1,"Barber, Miss. Ellen ""Nellie""",female,26.00,0,0,19877,78.8500,NaN,S,6,NaN,NaN
14,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.00,0,0,27042,30.0000,A23,S,B,NaN,"Hessle, Yorks"
15,1,0,"Baumann, Mr. John D",male,NaN,0,0,PC 17318,25.9250,NaN,S,NaN,NaN,"New York, NY"
16,1,0,"Baxter, Mr. Quigg Edmond",male,24.00,0,1,PC 17558,247.5208,B58 B60,C,NaN,NaN,"Montreal, PQ"
17,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.00,0,1,PC 17558,247.5208,B58 B60,C,6,NaN,"Montreal, PQ"
18,1,1,"Bazzani, Miss. Albina",female,32.00,0,0,11813,76.2917,D15,C,8,NaN,NaN
19,1,0,"Beattie, Mr. Thomson",male,36.00,0,0,13050,75.2417,C6,C,A,NaN,"Winnipeg, MN"

In [3]:
titanic.info()

#null 값이 존재하는 변수: age, fare, cabin, embarked, boat, body, home.dest

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.3+ KB

In [4]:
titanic.isnull().sum()

pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [5]:
tit=titanic.copy()
tit.sort_values(['name','ticket'],inplace=True,ignore_index=True)

In [6]:
tit.head(10)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,3,0,"Abbing, Mr. Anthony",male,42.0,0,0,C.A. 5547,7.5500,NaN,S,NaN,NaN,NaN
1,3,0,"Abbott, Master. Eugene Joseph",male,13.0,0,2,C.A. 2673,20.2500,NaN,S,NaN,NaN,"East Providence, RI"
2,3,0,"Abbott, Mr. Rossmore Edward",male,16.0,1,1,C.A. 2673,20.2500,NaN,S,NaN,190.0,"East Providence, RI"
3,3,1,"Abbott, Mrs. Stanton (Rosa Hunt)",female,35.0,1,1,C.A. 2673,20.2500,NaN,S,A,NaN,"East Providence, RI"
4,3,1,"Abelseth, Miss. Karen Marie",female,16.0,0,0,348125,7.6500,NaN,S,16,NaN,"Norway Los Angeles, CA"
5,3,1,"Abelseth, Mr. Olaus Jorgensen",male,25.0,0,0,348122,7.6500,F G63,S,A,NaN,"Perkins County, SD"
6,2,0,"Abelson, Mr. Samuel",male,30.0,1,0,P/PP 3381,24.0000,NaN,C,NaN,NaN,"Russia New York, NY"
7,2,1,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C,10,NaN,"Russia New York, NY"
8,3,1,"Abrahamsson, Mr. Abraham August Johannes",male,20.0,0,0,SOTON/O2 3101284,7.9250,NaN,S,15,NaN,"Taalintehdas, Finland Hoboken, NJ"
9,3,1,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.0,0,0,2657,7.2292,NaN,C,C,NaN,"Greensburg, PA"

#### cabin변수 null값 대체: 가족끼리 범주화

In [7]:
# 성만 분리해서 범주화하기

tit['last_name']=tit['name'].apply(lambda x: x.split(',')[0])
tit.head(30)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,last_name
0,3,0,"Abbing, Mr. Anthony",male,42.00,0,0,C.A. 5547,7.5500,NaN,S,NaN,NaN,NaN,Abbing
1,3,0,"Abbott, Master. Eugene Joseph",male,13.00,0,2,C.A. 2673,20.2500,NaN,S,NaN,NaN,"East Providence, RI",Abbott
2,3,0,"Abbott, Mr. Rossmore Edward",male,16.00,1,1,C.A. 2673,20.2500,NaN,S,NaN,190.0,"East Providence, RI",Abbott
3,3,1,"Abbott, Mrs. Stanton (Rosa Hunt)",female,35.00,1,1,C.A. 2673,20.2500,NaN,S,A,NaN,"East Providence, RI",Abbott
4,3,1,"Abelseth, Miss. Karen Marie",female,16.00,0,0,348125,7.6500,NaN,S,16,NaN,"Norway Los Angeles, CA",Abelseth
5,3,1,"Abelseth, Mr. Olaus Jorgensen",male,25.00,0,0,348122,7.6500,F G63,S,A,NaN,"Perkins County, SD",Abelseth
6,2,0,"Abelson, Mr. Samuel",male,30.00,1,0,P/PP 3381,24.0000,NaN,C,NaN,NaN,"Russia New York, NY",Abelson
7,2,1,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.00,1,0,P/PP 3381,24.0000,NaN,C,10,NaN,"Russia New York, NY",Abelson
8,3,1,"Abrahamsson, Mr. Abraham August Johannes",male,20.00,0,0,SOTON/O2 3101284,7.9250,NaN,S,15,NaN,"Taalintehdas, Finland Hoboken, NJ",Abrahamsson
9,3,1,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.00,0,0,2657,7.2292,NaN,C,C,NaN,"Greensburg, PA",Abrahim
10,3,0,"Adahl, Mr. Mauritz Nils Martin",male,30.00,0,0,C 7076,7.2500,NaN,S,NaN,72.0,"Asarum, Sweden Brooklyn, NY",Adahl
11,3,0,"Adams, Mr. John",male,26.00,0,0,341826,8.0500,NaN,S,NaN,103.0,"Bournemouth, England",Adams
12,3,0,"Ahlin, Mrs. Johan (Johanna Persdotter Larsson)",female,40.00,1,0,7546,9.4750,NaN,S,NaN,NaN,"Sweden Akeley, MN",Ahlin
13,3,1,"Aks, Master. Philip Frank",male,0.83,0,1,392091,9.3500,NaN,S,11,NaN,"London, England Norfolk, VA",Aks
14,3,1,"Aks, Mrs. Sam (Leah Rosen)",female,18.00,0,1,392091,9.3500,NaN,S,13,NaN,"London, England Norfolk, VA",Aks
15,3,1,"Albimona, Mr. Nassef Cassem",male,26.00,0,0,2699,18.7875,NaN,C,15,NaN,"Syria Fredericksburg, VA",Albimona
16,2,0,"Aldworth, Mr. Charles Augustus",male,30.00,0,0,248744,13.0000,NaN,S,NaN,NaN,"Bryn Mawr, PA, USA",Aldworth
17,3,0,"Alexander, Mr. William",male,26.00,0,0,3474,7.8875,NaN,S,NaN,NaN,"England Albion, NY",Alexander
18,3,0,"Alhomaki, Mr. Ilmari Rudolf",male,20.00,0,0,SOTON/O2 3101287,7.9250,NaN,S,NaN,NaN,"Salo, Finland Astoria, OR",Alhomaki
19,3,0,"Ali, Mr. Ahmed",male,24.00,0,0,SOTON/O.Q. 3101311,7.0500,NaN,S,NaN,NaN,NaN,Ali
20,3,0,"Ali, Mr. William",male,25.00,0,0,SOTON/O.Q. 3101312,7.0500,NaN,S,NaN,79.0,Argentina,Ali
21,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",Allen
22,3,0,"Allen, Mr. William Henry",male,35.00,0,0,373450,8.0500,NaN,S,NaN,NaN,"Lower Clapton, Middlesex or Erdington, Birmingham",Allen
23,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",Allison
24,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",Allison
25,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",Allison
26,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",Allison
27,3,0,"Allum, Mr. Owen George",male,18.00,0,0,2223,8.3000,NaN,S,NaN,259.0,"Windsor, England New York, NY",Allum
28,3,0,"Andersen, Mr. Albert Karvin",male,32.00,0,0,C 4001,22.5250,NaN,S,NaN,260.0,"Bergen, Norway",Andersen
29,3,1,"Andersen-Jensen, Miss. Carla Christine Nielsine",female,19.00,1,0,350046,7.8542,NaN,S,16,NaN,NaN,Andersen-Jensen

In [8]:
#중복없는 성의 개수 확인

len(set(tit['last_name']))

875

In [9]:
#성이 같은 사람들은 티켓번호도 다 같은지 확인하기

for lastname in set(tit['last_name']):
    names=tit[tit['last_name']==lastname]
    count=len(set(names['ticket']))
    if count>1:
        idx=names.index
        print(idx)
        print(tit.iloc[list(idx),[2,7,14]])

#다른 데이터도 있음을 확인,ex)idx=31~41

Int64Index([499, 500, 501, 502], dtype='int64')
                                         name    ticket last_name
499         Harper, Miss. Annie Jessie "Nina"    248727    Harper
500                 Harper, Mr. Henry Sleeper  PC 17572    Harper
501  Harper, Mrs. Henry Sleeper (Myna Haxtun)  PC 17572    Harper
502                         Harper, Rev. John    248727    Harper
Int64Index([341, 342, 343], dtype='int64')
                                                  name    ticket last_name
341                         Douglas, Mr. Walter Donald  PC 17761   Douglas
342  Douglas, Mrs. Frederick Charles (Mary Helene B...  PC 17558   Douglas
343        Douglas, Mrs. Walter Donald (Mahala Dutton)  PC 17761   Douglas
Int64Index([149, 150], dtype='int64')
                                              name  ticket last_name
149                   Bradley, Miss. Bridget Delia  334914   Bradley
150  Bradley, Mr. George ("George Arthur Brayton")  111427   Bradley
Int64Index([624, 625, 626], dtype='int64')
                                  name  ticket last_name
624      Karlsson, Mr. Einar Gervasius  350053  Karlsson
625  Karlsson, Mr. Julius Konrad Eugen  347465  Karlsson
626          Karlsson, Mr. Nils August  350060  Karlsson
Int64Index([1265, 1266], dtype='int64')
                           name   ticket last_name
1265  Wiklund, Mr. Jakob Alfred  3101267   Wiklund
1266    Wiklund, Mr. Karl Johan  3101266   Wiklund
Int64Index([481, 482], dtype='int64')
                                     name ticket last_name
481       Hagland, Mr. Ingvald Olai Olsen  65303   Hagland
482  Hagland, Mr. Konrad Mathias Reiersen  65304   Hagland
Int64Index([613, 614], dtype='int64')
                          name  ticket last_name
613          Jonsson, Mr. Carl  350417   Jonsson
614  Jonsson, Mr. Nils Hilding  350408   Jonsson
Int64Index([1042, 1043], dtype='int64')
                  name ticket last_name
1042    Saad, Mr. Amin   2671      Saad
1043  Saad, Mr. Khalil   2672      Saad
Int64Index([282, 283, 284], dtype='int64')
                                                  name     ticket last_name
282                       Crosby, Capt. Edward Gifford  WE/P 5735    Crosby
283                            Crosby, Miss. Harriet R  WE/P 5735    Crosby
284  Crosby, Mrs. Edward Gifford (Catherine Elizabe...     112901    Crosby
Int64Index([178, 179, 180, 181], dtype='int64')
                     name  ticket last_name
178    Cacic, Miss. Manda  315087     Cacic
179   Cacic, Miss. Marija  315084     Cacic
180  Cacic, Mr. Jego Grga  315091     Cacic
181       Cacic, Mr. Luka  315089     Cacic
Int64Index([1177, 1178, 1179, 1180, 1181], dtype='int64')
                                           name ticket last_name
1177            Thomas, Master. Assad Alexander   2625    Thomas
1178                      Thomas, Mr. Charles P   2621    Thomas
1179                           Thomas, Mr. John   2681    Thomas
1180                        Thomas, Mr. Tannous   2684    Thomas
1181  Thomas, Mrs. Alexander (Thamine "Thelma")   2625    Thomas
Int64Index([43, 44], dtype='int64')
                          name      ticket last_name
43  Andrew, Mr. Edgardo Samuel      231945    Andrew
44    Andrew, Mr. Frank Thomas  C.A. 34050    Andrew
Int64Index([562, 563, 564], dtype='int64')
                                             name       ticket last_name
562                   Howard, Miss. May Elizabeth  A. 2. 39186    Howard
563                          Howard, Mr. Benjamin        24065    Howard
564  Howard, Mrs. Benjamin (Ellen Truelove Arman)        24065    Howard
Int64Index([794, 795, 796], dtype='int64')
                                      name    ticket last_name
794                      Meyer, Mr. August    248723     Meyer
795                Meyer, Mr. Edgar Joseph  PC 17604     Meyer
796  Meyer, Mrs. Edgar Joseph (Leila Saks)  PC 17604     Meyer
Int64Index([867, 868, 869], dtype='int64')
                                name  ticket last_name
867      Nilsson, Miss. Berta Olivia  347066   Nilsson
868  Nilsson, Miss. Helmina Josefina  347470   Nilsson
869    Nilsson, Mr. August Ferdinand  350410   Nilsson
Int64Index([475, 476, 477, 478], dtype='int64')
                               name   ticket   last_name
475   Gustafsson, Mr. Alfred Ossian     7534  Gustafsson
476  Gustafsson, Mr. Anders Vilhelm  3101276  Gustafsson
477    Gustafsson, Mr. Johan Birger  3101277  Gustafsson
478     Gustafsson, Mr. Karl Gideon   347069  Gustafsson
Int64Index([632, 633, 634], dtype='int64')
                         name  ticket last_name
632       Keane, Miss. Nora A  226593     Keane
633  Keane, Mr. Andrew "Andy"   12460     Keane
634         Keane, Mr. Daniel  233734     Keane
Int64Index([19, 20], dtype='int64')
                name              ticket last_name
19    Ali, Mr. Ahmed  SOTON/O.Q. 3101311       Ali
20  Ali, Mr. William  SOTON/O.Q. 3101312       Ali
Int64Index([137, 138, 139, 140], dtype='int64')
                              name ticket last_name
137           Boulos, Master. Akar   2678    Boulos
138        Boulos, Miss. Nourelain   2678    Boulos
139              Boulos, Mr. Hanna   2664    Boulos
140  Boulos, Mrs. Joseph (Sultana)   2678    Boulos
Int64Index([353, 354], dtype='int64')
                                                  name    ticket    last_name
353  Duff Gordon, Lady. (Lucille Christiana Sutherl...     11755  Duff Gordon
354       Duff Gordon, Sir. Cosmo Edmund ("Mr Morgan")  PC 17485  Duff Gordon
Int64Index([357, 358], dtype='int64')
                               name         ticket     last_name
357    Duran y More, Miss. Asuncion  SC/PARIS 2149  Duran y More
358  Duran y More, Miss. Florentina  SC/PARIS 2148  Duran y More
Int64Index([141, 142, 143], dtype='int64')
                              name  ticket last_name
141             Bourke, Miss. Mary  364848    Bourke
142               Bourke, Mr. John  364849    Bourke
143  Bourke, Mrs. John (Catherine)  364849    Bourke
Int64Index([1272, 1273, 1274, 1275, 1276], dtype='int64')
                                   name    ticket last_name
1272        Williams, Mr. Charles Duane  PC 17597  Williams
1273       Williams, Mr. Charles Eugene    244373  Williams
1274  Williams, Mr. Howard Hugh "Harry"  A/5 2466  Williams
1275               Williams, Mr. Leslie     54636  Williams
1276    Williams, Mr. Richard Norris II  PC 17597  Williams
Int64Index([389, 390, 391], dtype='int64')
                                 name    ticket last_name
389                  Flynn, Mr. James    364851     Flynn
390                   Flynn, Mr. John    368323     Flynn
391  Flynn, Mr. John Irwin ("Irving")  PC 17474     Flynn
Int64Index([264, 265], dtype='int64')
                           name       ticket last_name
264             Cook, Mr. Jacob     A/5 3536      Cook
265  Cook, Mrs. (Selena Rogers)  W./C. 14266      Cook
Int64Index([171, 172], dtype='int64')
                                name  ticket last_name
171  Burns, Miss. Elizabeth Margaret   16966     Burns
172          Burns, Miss. Mary Delia  330963     Burns
Int64Index([565, 566, 567], dtype='int64')
                                                name    ticket last_name
565                     Hoyt, Mr. Frederick Maxfield     19943      Hoyt
566                         Hoyt, Mr. William Fisher  PC 17600      Hoyt
567  Hoyt, Mrs. Frederick Maxfield (Jane Anne Forby)     19943      Hoyt
Int64Index([822, 823], dtype='int64')
                                               name  ticket last_name
822  Morley, Mr. Henry Samuel ("Mr Henry Marshall")  250655    Morley
823                             Morley, Mr. William  364506    Morley
Int64Index([660, 661, 662], dtype='int64')
                                               name  ticket last_name
660                    Klasen, Miss. Gertrud Emilia  350405    Klasen
661                          Klasen, Mr. Klas Albin  350404    Klasen
662  Klasen, Mrs. (Hulda Kristina Eugenia Lofqvist)  350405    Klasen
Int64Index([191, 192], dtype='int64')
                     name  ticket last_name
191   Canavan, Miss. Mary  364846   Canavan
192  Canavan, Mr. Patrick  364858   Canavan
Int64Index([903, 904, 905], dtype='int64')
                        name  ticket  last_name
903   Oreskovic, Miss. Jelka  315085  Oreskovic
904  Oreskovic, Miss. Marija  315096  Oreskovic
905      Oreskovic, Mr. Luka  315094  Oreskovic
Int64Index([411, 412], dtype='int64')
                                       name              ticket last_name
411  Franklin, Mr. Charles (Charles Fardon)  SOTON/O.Q. 3101314  Franklin
412             Franklin, Mr. Thomas Parham              113778  Franklin
Int64Index([154, 155], dtype='int64')
                          name     ticket last_name
154  Braund, Mr. Lewis Richard       3460    Braund
155    Braund, Mr. Owen Harris  A/5 21171    Braund
Int64Index([961, 962], dtype='int64')
                                 name  ticket last_name
961              Petroff, Mr. Nedelio  349212   Petroff
962  Petroff, Mr. Pastcho ("Pentcho")  349215   Petroff
Int64Index([159, 160, 161, 162, 163, 164], dtype='int64')
                                                  name    ticket last_name
159                      Brown, Miss. Amelia "Mildred"    248733     Brown
160                          Brown, Miss. Edith Eileen     29750     Brown
161                  Brown, Mr. Thomas William Solomon     29750     Brown
162          Brown, Mrs. James Joseph (Margaret Tobin)  PC 17610     Brown
163     Brown, Mrs. John Murray (Caroline Lane Lamson)     11769     Brown
164  Brown, Mrs. Thomas William Solomon (Elizabeth ...     29750     Brown
Int64Index([879, 880, 881], dtype='int64')
                                                name  ticket last_name
879                              O'Brien, Mr. Thomas  370365   O'Brien
880                             O'Brien, Mr. Timothy  330979   O'Brien
881  O'Brien, Mrs. Thomas (Johanna "Hannah" Godfrey)  370365   O'Brien

Int64Index([883, 884], dtype='int64')
                      name  ticket last_name
883  O'Connor, Mr. Maurice  371060  O'Connor
884  O'Connor, Mr. Patrick  366713  O'Connor
Int64Index([266, 267, 268], dtype='int64')
                  name  ticket last_name
266    Cor, Mr. Bartol  349230       Cor
267      Cor, Mr. Ivan  349229       Cor
268  Cor, Mr. Liudevit  349231       Cor
Int64Index([966, 967, 968], dtype='int64')
                                                  name       ticket last_name
966               Phillips, Miss. Alice Frances Louisa  S.O./P.P. 2  Phillips
967  Phillips, Miss. Kate Florence ("Mrs Kate Louis...       250655  Phillips
968                        Phillips, Mr. Escott Robert  S.O./P.P. 2  Phillips
Int64Index([465, 466, 467], dtype='int64')
                                              name    ticket last_name
465                   Graham, Miss. Margaret Edith    112053    Graham
466                      Graham, Mr. George Edward  PC 17582    Graham
467  Graham, Mrs. William Thompson (Edith Junkins)  PC 17582    Graham
Int64Index([261, 262], dtype='int64')
                     name  ticket last_name
261  Connolly, Miss. Kate  330972  Connolly
262  Connolly, Miss. Kate  370373  Connolly
Int64Index([387, 388], dtype='int64')
                        name  ticket last_name
387    Fleming, Miss. Honora  364859   Fleming
388  Fleming, Miss. Margaret   17421   Fleming
Int64Index([601, 602, 603, 604, 605, 606], dtype='int64')
                                                  name  ticket last_name
601                    Johnson, Master. Harold Theodor  347742   Johnson
602                       Johnson, Miss. Eleanor Ileen  347742   Johnson
603                                Johnson, Mr. Alfred    LINE   Johnson
604                       Johnson, Mr. Malkolm Joackim  347062   Johnson
605                    Johnson, Mr. William Cahoone Jr    LINE   Johnson
606  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  347742   Johnson
Int64Index([451, 452, 453, 454], dtype='int64')
                                                name              ticket  \
451  Goldsmith, Master. Frank John William "Frankie"              363291
452                        Goldsmith, Mr. Frank John              363291
453                            Goldsmith, Mr. Nathan  SOTON/O.Q. 3101263
454   Goldsmith, Mrs. Frank John (Emily Alice Brown)              363291

     last_name
451  Goldsmith
452  Goldsmith
453  Goldsmith
454  Goldsmith
Int64Index([509, 510, 511, 512], dtype='int64')
                                            name        ticket last_name
509                       Hart, Miss. Eva Miriam  F.C.C. 13529      Hart
510                           Hart, Mr. Benjamin  F.C.C. 13529      Hart
511                              Hart, Mr. Henry        394140      Hart
512  Hart, Mrs. Benjamin (Esther Ada Bloomfield)  F.C.C. 13529      Hart
Int64Index([223, 224, 225], dtype='int64')
                                                name       ticket last_name
223                       Chapman, Mr. Charles Henry       248731   Chapman
224                          Chapman, Mr. John Henry  SC/AH 29037   Chapman
225  Chapman, Mrs. John Henry (Sara Elizabeth Lawry)  SC/AH 29037   Chapman
Int64Index([187, 188], dtype='int64')
                 name  ticket last_name
187   Calic, Mr. Jovo  315093     Calic
188  Calic, Mr. Petar  315086     Calic
Int64Index([575, 576], dtype='int64')
                              name            ticket   last_name
575   Ilmakangas, Miss. Ida Livija  STON/O2. 3101270  Ilmakangas
576  Ilmakangas, Miss. Pieta Sofia  STON/O2. 3101271  Ilmakangas
Int64Index([516, 517, 518], dtype='int64')
                                                  name ticket last_name
516                     Hays, Miss. Margaret Bechstein  11767      Hays
517                         Hays, Mr. Charles Melville  12749      Hays
518  Hays, Mrs. Charles Melville (Clara Jennings Gr...  12749      Hays
Int64Index([45, 46], dtype='int64')
                                 name  ticket last_name
45  Andrews, Miss. Kornelia Theodosia   13502   Andrews
46             Andrews, Mr. Thomas Jr  112050   Andrews
Int64Index([167, 168], dtype='int64')
                         name  ticket last_name
167  Buckley, Miss. Katherine  329944   Buckley
168       Buckley, Mr. Daniel  330920   Buckley
Int64Index([1116, 1117, 1118, 1119, 1120, 1121], dtype='int64')
                                                name  ticket last_name
1116                       Smith, Miss. Marion Elsie   31418     Smith
1117                         Smith, Mr. James Clinch   17764     Smith
1118                        Smith, Mr. Lucien Philip   13695     Smith
1119                      Smith, Mr. Richard William  113056     Smith
1120                               Smith, Mr. Thomas  384461     Smith
1121  Smith, Mrs. Lucien Philip (Mary Eloise Hughes)   13695     Smith
Int64Index([818, 819, 820], dtype='int64')
                    name  ticket last_name
818  Moran, Miss. Bertha  371110     Moran
819  Moran, Mr. Daniel J  371110     Moran
820     Moran, Mr. James  330877     Moran
Int64Index([31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41], dtype='int64')
                                                 name   ticket  last_name
31            Andersson, Master. Sigvard Harald Elias   347082  Andersson
32                 Andersson, Miss. Ebba Iris Alfrida   347082  Andersson
33                  Andersson, Miss. Ellis Anna Maria   347082  Andersson
34                    Andersson, Miss. Erna Alexandra  3101281  Andersson
35             Andersson, Miss. Ida Augusta Margareta   347091  Andersson
36               Andersson, Miss. Ingeborg Constanzia   347082  Andersson
37                  Andersson, Miss. Sigrid Elisabeth   347082  Andersson
38                        Andersson, Mr. Anders Johan   347082  Andersson
39       Andersson, Mr. August Edvard ("Wennerstrom")   350043  Andersson
40                        Andersson, Mr. Johan Samuel   347075  Andersson
41  Andersson, Mrs. Anders Johan (Alfrida Konstant...   347082  Andersson
Int64Index([597, 598, 599, 600], dtype='int64')
                           name  ticket  last_name
597         Johansson, Mr. Erik  350052  Johansson
598  Johansson, Mr. Gustaf Joel    7540  Johansson
599   Johansson, Mr. Karl Johan  347063  Johansson
600         Johansson, Mr. Nils  347467  Johansson
Int64Index([1035, 1036], dtype='int64')
                   name  ticket last_name
1035   Ryan, Mr. Edward  383162      Ryan
1036  Ryan, Mr. Patrick  371110      Ryan
Int64Index([1138, 1139], dtype='int64')
                                 name     ticket last_name
1138  Stanley, Miss. Amy Zillah Elsie   CA. 2314   Stanley
1139       Stanley, Mr. Edward Roland  A/4 45380   Stanley
Int64Index([589, 590, 591], dtype='int64')
                          name  ticket last_name
589     Jensen, Mr. Hans Peder  350050    Jensen
590    Jensen, Mr. Niels Peder  350047    Jensen
591  Jensen, Mr. Svend Lauritz  350048    Jensen
Int64Index([835, 836, 837], dtype='int64')
                               name  ticket last_name
835  Murphy, Miss. Katherine "Kate"  367230    Murphy
836     Murphy, Miss. Margaret Jane  367230    Murphy
837              Murphy, Miss. Nora   36568    Murphy
Int64Index([1233, 1234, 1235], dtype='int64')
                                                  name      ticket last_name
1233                       Warren, Mr. Charles William  C.A. 49867    Warren
1234                          Warren, Mr. Frank Manley      110813    Warren
1235  Warren, Mrs. Frank Manley (Anna Sophia Atkinson)      110813    Warren
Int64Index([4, 5], dtype='int64')
                            name  ticket last_name
4    Abelseth, Miss. Karen Marie  348125  Abelseth
5  Abelseth, Mr. Olaus Jorgensen  348122  Abelseth
Int64Index([816, 817], dtype='int64')
                               name     ticket last_name
816  Moore, Mr. Clarence Bloomfield     113796     Moore
817      Moore, Mr. Leonard Charles  A4. 54510     Moore
Int64Index([545, 546, 547, 548], dtype='int64')
                                      name  ticket last_name
545          Hocking, Miss. Ellen "Nellie"   29105   Hocking
546            Hocking, Mr. Richard George   29104   Hocking
547     Hocking, Mr. Samuel James Metcalfe  242963   Hocking
548  Hocking, Mrs. Elizabeth (Eliza Needs)   29105   Hocking
Int64Index([504, 505, 506, 507], dtype='int64')
                                             name       ticket last_name
504                            Harris, Mr. George  S.W./PP 752    Harris
505                   Harris, Mr. Henry Birkhardt        36973    Harris
506                            Harris, Mr. Walter    W/C 14208    Harris
507  Harris, Mrs. Henry Birkhardt (Irene Wallach)        36973    Harris
Int64Index([648, 649], dtype='int64')
                    name  ticket last_name
648    Kiernan, Mr. John  367227   Kiernan
649  Kiernan, Mr. Philip  367229   Kiernan
Int64Index([1161, 1162, 1163], dtype='int64')
                            name  ticket last_name
1161         Svensson, Mr. Johan  347060  Svensson
1162  Svensson, Mr. Johan Cervin    7538  Svensson
1163          Svensson, Mr. Olof  350035  Svensson
Int64Index([1229, 1230, 1231, 1232], dtype='int64')
                                              name    ticket last_name
1229                           Ware, Mr. Frederick    359309      Ware
1230                          Ware, Mr. John James  CA 31352      Ware
1231                     Ware, Mr. William Jeffery     28666      Ware
1232  Ware, Mrs. John James (Florence Louise Long)  CA 31352      Ware
Int64Index([637, 638, 639, 640, 641], dtype='int64')
                                         name  ticket last_name
637  Kelly, Miss. Anna Katherine "Annie Kate"    9234     Kelly
638                         Kelly, Miss. Mary   14312     Kelly
639                          Kelly, Mr. James  330911     Kelly
640                          Kelly, Mr. James  363592     Kelly
641             Kelly, Mrs. Florence "Fannie"  223596     Kelly
Int64Index([972, 973], dtype='int64')
                  name  ticket last_name
972  Pokrnic, Mr. Mate  315095   Pokrnic
973  Pokrnic, Mr. Tome  315092   Pokrnic
Int64Index([247, 248], dtype='int64')
                  name  ticket last_name
247   Coleff, Mr. Peju  349210    Coleff
248  Coleff, Mr. Satio  349209    Coleff
Int64Index([1255, 1256, 1257], dtype='int64')
                                       name    ticket last_name
1255            White, Mr. Percival Wayland     35281     White
1256              White, Mr. Richard Frasar     35281     White
1257  White, Mrs. John Stuart (Ella Holmes)  PC 17760     White
Int64Index([203, 204], dtype='int64')
                          name  ticket last_name
203  Carr, Miss. Helen "Ellen"  367231      Carr
204        Carr, Miss. Jeannie  368364      Carr
Int64Index([894, 895, 896, 897], dtype='int64')
                                 name     ticket last_name
894         Olsen, Master. Artur Karl    C 17368     Olsen
895          Olsen, Mr. Henry Margido     C 4001     Olsen
896  Olsen, Mr. Karl Siegwart Andreas       4579     Olsen
897             Olsen, Mr. Ole Martin  Fa 265302     Olsen
Int64Index([743, 744], dtype='int64')
                           name     ticket last_name
743  Mahon, Miss. Bridget Delia     330924     Mahon
744             Mahon, Mr. John  AQ/4 3130     Mahon
Int64Index([683, 684], dtype='int64')
                           name  ticket last_name
683  Larsson, Mr. August Viktor    7545   Larsson
684    Larsson, Mr. Bengt Edvin  347067   Larsson
Int64Index([21, 22], dtype='int64')
                             name  ticket last_name
21  Allen, Miss. Elisabeth Walton   24160     Allen
22       Allen, Mr. William Henry  373450     Allen
Int64Index([324, 325], dtype='int64')
                    name     ticket last_name
324   Dennis, Mr. Samuel  A/5 21172    Dennis
325  Dennis, Mr. William  A/5 21175    Dennis
Int64Index([392, 393], dtype='int64')
                   name  ticket last_name
392   Foley, Mr. Joseph  330910     Foley
393  Foley, Mr. William  365235     Foley
Int64Index([57, 58, 59, 60, 61, 62, 63, 64], dtype='int64')
                                                 name  ticket last_name
57                        Asplund, Master. Carl Edgar  347077   Asplund
58              Asplund, Master. Clarence Gustaf Hugo  347077   Asplund
59                  Asplund, Master. Edvin Rojj Felix  347077   Asplund
60                       Asplund, Master. Filip Oscar  347077   Asplund
61                     Asplund, Miss. Lillian Gertrud  347077   Asplund
62         Asplund, Mr. Carl Oscar Vilhelm Gustafsson  347077   Asplund
63                         Asplund, Mr. Johan Charles  350054   Asplund
64  Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...  347077   Asplund
Int64Index([768, 769], dtype='int64')
                                  name  ticket last_name
768  McCarthy, Miss. Catherine "Katie"  383123  McCarthy
769            McCarthy, Mr. Timothy J   17463  McCarthy

Int64Index([395, 396, 397, 398, 399, 400], dtype='int64')
                                        name      ticket last_name
395     Ford, Miss. Doolina Margaret "Daisy"  W./C. 6608      Ford
396         Ford, Miss. Robina Maggie "Ruby"  W./C. 6608      Ford
397                         Ford, Mr. Arthur    A/5 1478      Ford
398                  Ford, Mr. Edward Watson  W./C. 6608      Ford
399                   Ford, Mr. William Neal  W./C. 6608      Ford
400  Ford, Mrs. Edward (Margaret Ann Watson)  W./C. 6608      Ford
Int64Index([1016, 1017], dtype='int64')
                            name           ticket last_name
1016  Rogers, Mr. Reginald Harry            28004    Rogers
1017    Rogers, Mr. William John  S.C./A.4. 23567    Rogers
Int64Index([1284, 1285], dtype='int64')
                      name  ticket last_name
1284  Wright, Miss. Marion  220844    Wright
1285    Wright, Mr. George  113807    Wright
Int64Index([366, 367, 368, 369], dtype='int64')
                     name ticket last_name
366       Elias, Mr. Dibo   2674     Elias
367     Elias, Mr. Joseph   2675     Elias
368  Elias, Mr. Joseph Jr   2690     Elias
369    Elias, Mr. Tannous   2695     Elias
Int64Index([616, 617, 618], dtype='int64')
                         name             ticket last_name
616   Jussila, Miss. Katriina               4136   Jussila
617  Jussila, Miss. Mari Aina               4137   Jussila
618       Jussila, Mr. Eiriik  STON/O 2. 3101286   Jussila
Int64Index([293, 294, 295], dtype='int64')
                                       name  ticket last_name
293  Daly, Miss. Margaret Marcella "Maggie"  382650      Daly
294                Daly, Mr. Eugene Patrick  382651      Daly
295                  Daly, Mr. Peter Denis   113055      Daly
Int64Index([305, 306, 307, 308, 309, 310, 311], dtype='int64')
                                                  name        ticket last_name
305                     Davies, Master. John Morgan Jr    C.A. 33112    Davies
306                               Davies, Mr. Alfred J     A/4 48871    Davies
307                          Davies, Mr. Charles Henry  S.O.C. 14879    Davies
308                                   Davies, Mr. Evan   SC/A4 23568    Davies
309                            Davies, Mr. John Samuel     A/4 48871    Davies
310                                 Davies, Mr. Joseph     A/4 48873    Davies
311  Davies, Mrs. John Morgan (Elizabeth Agnes Mary...    C.A. 33112    Davies
Int64Index([118, 119], dtype='int64')
                      name ticket last_name
118  Betros, Master. Seman   2622    Betros
119    Betros, Mr. Tannous   2648    Betros
Int64Index([898, 899, 900], dtype='int64')
                                 name  ticket last_name
898               Olsson, Miss. Elina  350407    Olsson
899  Olsson, Mr. Nils Johan Goransson  347464    Olsson
900         Olsson, Mr. Oscar Wilhelm  347079    Olsson
Int64Index([144, 145], dtype='int64')
                            name    ticket last_name
144     Bowen, Miss. Grace Scott  PC 17608     Bowen
145  Bowen, Mr. David John "Dai"     54636     Bowen
Int64Index([780, 781], dtype='int64')
                            name  ticket last_name
780  McGowan, Miss. Anna "Annie"  330923   McGowan
781     McGowan, Miss. Katherine    9232   McGowan
Int64Index([653, 654], dtype='int64')
                  name  ticket last_name
653  Kink, Miss. Maria  315152      Kink
654  Kink, Mr. Vincenz  315151      Kink
Int64Index([200, 201, 202], dtype='int64')
                             name  ticket last_name
200  Carlsson, Mr. August Sigfrid  350042  Carlsson
201     Carlsson, Mr. Carl Robert  350409  Carlsson
202      Carlsson, Mr. Frans Olof     695  Carlsson
Int64Index([1239, 1240], dtype='int64')
                     name            ticket last_name
1239  Webber, Miss. Susan             27267    Webber
1240    Webber, Mr. James  SOTON/OQ 3101316    Webber
Int64Index([1216, 1217, 1218, 1219], dtype='int64')
                                                   name  ticket      last_name
1216                 Vander Planke, Miss. Augusta Maria  345764  Vander Planke
1217                          Vander Planke, Mr. Julius  345763  Vander Planke
1218                    Vander Planke, Mr. Leo Edmondus  345764  Vander Planke
1219  Vander Planke, Mrs. Julius (Emelia Maria Vande...  345763  Vander Planke
Int64Index([413, 414, 415], dtype='int64')
                                                  name    ticket   last_name
413                      Frauenthal, Dr. Henry William  PC 17611  Frauenthal
414                       Frauenthal, Mr. Isaac Gerald     17765  Frauenthal
415  Frauenthal, Mrs. Henry William (Clara Heinshei...  PC 17611  Frauenthal
Int64Index([1295, 1296], dtype='int64')
                           name ticket last_name
1295  Zakarian, Mr. Mapriededer   2656  Zakarian
1296        Zakarian, Mr. Ortin   2670  Zakarian
Int64Index([408, 409], dtype='int64')
                        name  ticket last_name
408         Fox, Mr. Patrick  368573       Fox
409  Fox, Mr. Stanley Hubert  229236       Fox
Int64Index([207, 208, 209, 210, 211, 212], dtype='int64')
                                              name  ticket last_name
207            Carter, Master. William Thornton II  113760    Carter
208                      Carter, Miss. Lucile Polk  113760    Carter
209                     Carter, Mr. William Ernest  113760    Carter
210  Carter, Mrs. Ernest Courtenay (Lilian Hughes)  244252    Carter
211      Carter, Mrs. William Ernest (Lucile Polk)  113760    Carter
212                  Carter, Rev. Ernest Courtenay  244252    Carter
Int64Index([490, 491, 492, 493], dtype='int64')
                                           name  ticket last_name
490                     Hansen, Mr. Claus Peter  350026    Hansen
491                     Hansen, Mr. Henrik Juul  350025    Hansen
492                 Hansen, Mr. Henry Damsgaard  350029    Hansen
493  Hansen, Mrs. Claus Peter (Jennie L Howard)  350026    Hansen
Int64Index([70, 71], dtype='int64')
                     name ticket last_name
70  Attalah, Miss. Malake   2627   Attalah
71   Attalah, Mr. Sleiman   2694   Attalah
Int64Index([439, 440, 441], dtype='int64')
                            name  ticket last_name
439             Giles, Mr. Edgar   28133     Giles
440  Giles, Mr. Frederick Edward   28134     Giles
441             Giles, Mr. Ralph  248726     Giles
Int64Index([132, 133], dtype='int64')
                         name  ticket last_name
132   Bonnell, Miss. Caroline   36928   Bonnell
133  Bonnell, Miss. Elizabeth  113783   Bonnell

In [10]:
# 성이 같고, 티켓 번호가 같은 사람들끼리 그룹화

for lastname in set(tit['last_name']):
    names=tit[tit['last_name']==lastname]
    named_ticket=set(names['ticket'])
    count=len(named_ticket)
    if count>1:
        category=0
        for tic in named_ticket:
            tit.loc[(tit['last_name']==lastname)&(tit['ticket']==tic),'last_name']=tit['last_name']+'_'+str(category)
            category+=1

In [11]:
#그룹화가 잘되어있는지 확인
#성이 같은 사람들은 티켓번호도 다 같은지 확인하기

for lastname in set(tit['last_name']):
    names=tit[tit['last_name']==lastname]
    count=len(set(names['ticket']))
    if count>1:
        idx=names.index
        print(idx)
        print(tit.iloc[list(idx),[2,7,14]])   #full name, ticket 번호, lastname 출력

In [12]:
#중복없는 성의 개수 확인

len(set(tit.last_name))

1024

In [13]:
#데이터로 확인

tit.iloc[31:41]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,last_name
31,3,0,"Andersson, Master. Sigvard Harald Elias",male,4.0,4,2,347082,31.2750,NaN,S,NaN,NaN,"Sweden Winnipeg, MN",Andersson_2
32,3,0,"Andersson, Miss. Ebba Iris Alfrida",female,6.0,4,2,347082,31.2750,NaN,S,NaN,NaN,"Sweden Winnipeg, MN",Andersson_2
33,3,0,"Andersson, Miss. Ellis Anna Maria",female,2.0,4,2,347082,31.2750,NaN,S,NaN,NaN,"Sweden Winnipeg, MN",Andersson_2
34,3,1,"Andersson, Miss. Erna Alexandra",female,17.0,4,2,3101281,7.9250,NaN,S,D,NaN,"Ruotsinphyhtaa, Finland New York, NY",Andersson_4
35,3,0,"Andersson, Miss. Ida Augusta Margareta",female,38.0,4,2,347091,7.7750,NaN,S,NaN,NaN,"Vadsbro, Sweden Ministee, MI",Andersson_1
36,3,0,"Andersson, Miss. Ingeborg Constanzia",female,9.0,4,2,347082,31.2750,NaN,S,NaN,NaN,"Sweden Winnipeg, MN",Andersson_2
37,3,0,"Andersson, Miss. Sigrid Elisabeth",female,11.0,4,2,347082,31.2750,NaN,S,NaN,NaN,"Sweden Winnipeg, MN",Andersson_2
38,3,0,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S,NaN,NaN,"Sweden Winnipeg, MN",Andersson_2
39,3,1,"Andersson, Mr. August Edvard (""Wennerstrom"")",male,27.0,0,0,350043,7.7958,NaN,S,A,NaN,NaN,Andersson_0
40,3,0,"Andersson, Mr. Johan Samuel",male,26.0,0,0,347075,7.7750,NaN,S,NaN,NaN,"Hartford, CT",Andersson_3

이 과정을 진행한 이유는 결측값이 많은 cabin을 대체하기 위해서임.
cabin은 선실번호로, 성이 같은 가족은 cabin도 같을 것으로 추정됨
따라서, last_name 변수의 이름을 나중에 인코딩할 때 활용하도록 cobin_category로 바꾸겠음

In [14]:
tit2=tit.rename(columns={'last_name':'cabin_category'})
tit2.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,cabin_category
0,3,0,"Abbing, Mr. Anthony",male,42.0,0,0,C.A. 5547,7.55,NaN,S,NaN,NaN,NaN,Abbing
1,3,0,"Abbott, Master. Eugene Joseph",male,13.0,0,2,C.A. 2673,20.25,NaN,S,NaN,NaN,"East Providence, RI",Abbott
2,3,0,"Abbott, Mr. Rossmore Edward",male,16.0,1,1,C.A. 2673,20.25,NaN,S,NaN,190.0,"East Providence, RI",Abbott
3,3,1,"Abbott, Mrs. Stanton (Rosa Hunt)",female,35.0,1,1,C.A. 2673,20.25,NaN,S,A,NaN,"East Providence, RI",Abbott
4,3,1,"Abelseth, Miss. Karen Marie",female,16.0,0,0,348125,7.65,NaN,S,16,NaN,"Norway Los Angeles, CA",Abelseth_0

#### age변수 null값 대체

In [15]:
tit3=tit2.copy()
tit3.corr()

#pclass와 상관성이 상대적으로 높아보임

            pclass  survived       age     sibsp     parch      fare      body
pclass    1.000000 -0.312469 -0.408106  0.060832  0.018322 -0.558629 -0.034642
survived -0.312469  1.000000 -0.055512 -0.027825  0.082660  0.244265       NaN
age      -0.408106 -0.055512  1.000000 -0.243699 -0.150917  0.178740  0.058809
sibsp     0.060832 -0.027825 -0.243699  1.000000  0.373587  0.160238 -0.099961
parch     0.018322  0.082660 -0.150917  0.373587  1.000000  0.221539  0.051099
fare     -0.558629  0.244265  0.178740  0.160238  0.221539  1.000000 -0.043110
body     -0.034642       NaN  0.058809 -0.099961  0.051099 -0.043110  1.000000

In [16]:
#생존여부별 좌석 등급별 나이 평균값, 최소값, 최대값

grouped_p=tit3.groupby('pclass')
grouped_p.agg({'age':['mean','min','max','count']})

#(max-min)범위가 너무 커서 평균값 대체가 의미가 없어보임

              age
             mean   min   max count
pclass
1       39.159930  0.92  80.0   284
2       29.506705  0.67  70.0   261
3       24.816367  0.17  74.0   501

In [17]:
grouped_p.age.describe().T

#평균값과 중앙값이 차이가 없어보임

pclass           1           2           3
count   284.000000  261.000000  501.000000
mean     39.159930   29.506705   24.816367
std      14.548028   13.638627   11.958202
min       0.920000    0.670000    0.170000
25%      28.000000   22.000000   18.000000
50%      39.000000   29.000000   24.000000
75%      50.000000   36.000000   32.000000
max      80.000000   70.000000   74.000000

In [18]:
#생존여부별/좌석 등급별 나이 평균값, 최소값, 최대값
grouped_p=tit2.groupby(['survived','pclass'])
grouped_p.agg({'age':['mean','min','max','count']})

#(max-min)범위가 너무 커서 평균값 대체가 의미가 없어보임

                       age
                      mean    min   max count
survived pclass
0        1       43.247573   2.00  71.0   103
         2       33.167808  14.00  70.0   146
         3       25.974541   0.33  74.0   370
1        1       36.833812   0.92  80.0   181
         2       24.858696   0.67  62.0   115
         3       21.545191   0.17  63.0   131

In [19]:
#세부 그룹화
#생존여부, 좌석등급 및 형제자매수, 부모자식수에 따라서도 그룹화

grouped_pf=tit3.groupby(['survived','pclass','sibsp','parch'])
grouped_pf=grouped_pf.agg({'age':['mean','min','max','count']}).round(2)
grouped_pf

                               age
                              mean    min   max count
survived pclass sibsp parch
0        1      0     0      43.96  17.00  71.0    58
                      1      41.43  21.00  65.0     7
                      2      42.50  27.00  58.0     2
                1     0      41.59  18.00  67.0    22
                      1      52.86  37.00  70.0     7
...                            ...    ...   ...   ...
1        3      2     0        NaN    NaN   NaN     0
                      1       2.17   0.75   5.0     3
                3     0      33.00  33.00  33.0     1
                      1      29.00  29.00  29.0     1
                4     2       8.33   3.00  17.0     3

[75 rows x 4 columns]

In [20]:
#대체해야할 survived, pclass, sibsp, parch의 중복값 제거한 행 살펴보기

age_null=tit3[tit3['age'].isnull()]
age_null_s=age_null[['survived','pclass','sibsp','parch']].sort_values(['survived','pclass','sibsp','parch'])
age_null_sd=age_null_s.drop_duplicates()
age_null_sd

      survived  pclass  sibsp  parch
97           0       1      0      0
190          0       2      0      0
118          0       3      0      0
140          0       3      0      2
693          0       3      0      4
195          0       3      1      0
1305         0       3      1      1
607          0       3      1      2
1058         0       3      1      9
1065         0       3      2      0
689          0       3      3      1
1049         0       3      8      2
150          1       1      0      0
230          1       1      0      1
415          1       1      1      0
632          1       2      0      0
384          1       3      0      0
828          1       3      0      2
314          1       3      1      0
826          1       3      1      1
771          1       3      2      0

In [21]:
s.columns

NameError: name 's' is not defined

In [ ]:
s=grouped_pf.reset_index()
s

In [22]:
# age null 값을 생존여부, 좌석등급, 형제자매수, 부모자식수 범주 구간별 평균값으로 대체하기
import numpy as np

idx=list(tit3[tit3['age'].isnull()].index)

In [23]:
tit3.isnull().sum()

pclass               0
survived             0
name                 0
sex                  0
age                263
sibsp                0
parch                0
ticket               0
fare                 1
cabin             1014
embarked             2
boat               823
body              1188
home.dest          564
cabin_category       0
dtype: int64

In [24]:
#age null값 대체하기
#좌석등급, 가족 수에 따라 null값을 평균값으로 대체
tit3=tit2.copy()
li=[[1,0,0,40.49],[1,1,0,38.73],[1,0,1,36.77],[2,0,0,32.22],[3,0,0,27.61],
      [3,0,2,22.39],[3,1,1,16.75],[3,1,0,26.45],[3,8,2,14.50],
      [3,1,9,41.50],[3,2,0,25.00],[3,1,2,15.04],[3,3,1,9.60],[3,0,4,29.00]]

for i,j,k,m in li:
    tit3.loc[(tit3['pclass']==i)&(tit3['sibsp']==j)&(tit3['parch']==k),'age']=m

tit3.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,cabin_category
0,3,0,"Abbing, Mr. Anthony",male,27.61,0,0,C.A. 5547,7.55,NaN,S,NaN,NaN,NaN,Abbing
1,3,0,"Abbott, Master. Eugene Joseph",male,22.39,0,2,C.A. 2673,20.25,NaN,S,NaN,NaN,"East Providence, RI",Abbott
2,3,0,"Abbott, Mr. Rossmore Edward",male,16.75,1,1,C.A. 2673,20.25,NaN,S,NaN,190.0,"East Providence, RI",Abbott
3,3,1,"Abbott, Mrs. Stanton (Rosa Hunt)",female,16.75,1,1,C.A. 2673,20.25,NaN,S,A,NaN,"East Providence, RI",Abbott
4,3,1,"Abelseth, Miss. Karen Marie",female,27.61,0,0,348125,7.65,NaN,S,16,NaN,"Norway Los Angeles, CA",Abelseth_0

In [25]:
#null값 여부 확인
tit3.isnull().sum()

pclass               0
survived             0
name                 0
sex                  0
age                  0
sibsp                0
parch                0
ticket               0
fare                 1
cabin             1014
embarked             2
boat               823
body              1188
home.dest          564
cabin_category       0
dtype: int64

In [26]:
#age 범주화
def age_category(x):
    y=0
    if x<10:
        y='baby'
    elif x<20:
        y='10대'
    elif x<30:
        y='20대'
    elif x<40:
        y='30대'
    elif x<50:
        y='40대'
    elif x<60:
        y='50대'
    elif x>=60:
        y='60대'
    return y

tit3['age_c']=tit3['age'].apply(age_category)
tit3.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,cabin_category,age_c
0,3,0,"Abbing, Mr. Anthony",male,27.61,0,0,C.A. 5547,7.55,NaN,S,NaN,NaN,NaN,Abbing,20대
1,3,0,"Abbott, Master. Eugene Joseph",male,22.39,0,2,C.A. 2673,20.25,NaN,S,NaN,NaN,"East Providence, RI",Abbott,20대
2,3,0,"Abbott, Mr. Rossmore Edward",male,16.75,1,1,C.A. 2673,20.25,NaN,S,NaN,190.0,"East Providence, RI",Abbott,10대
3,3,1,"Abbott, Mrs. Stanton (Rosa Hunt)",female,16.75,1,1,C.A. 2673,20.25,NaN,S,A,NaN,"East Providence, RI",Abbott,10대
4,3,1,"Abelseth, Miss. Karen Marie",female,27.61,0,0,348125,7.65,NaN,S,16,NaN,"Norway Los Angeles, CA",Abelseth_0,20대

In [27]:
tit3.age_c.value_counts()

20대     626
30대     305
40대     195
10대      90
baby     66
50대      17
60대      10
Name: age_c, dtype: int64

#### body변수:  null값 삭제

In [28]:
tit4=tit3.copy()
tit4.isnull().sum()

#null값이 너무 많음

pclass               0
survived             0
name                 0
sex                  0
age                  0
sibsp                0
parch                0
ticket               0
fare                 1
cabin             1014
embarked             2
boat               823
body              1188
home.dest          564
cabin_category       0
age_c                0
dtype: int64

In [29]:
tit4.corr()

#연령 변수와 그나마 상관성이 있어보임

            pclass  survived       age     sibsp     parch      fare      body
pclass    1.000000 -0.312469 -0.592451  0.060832  0.018322 -0.558629 -0.034642
survived -0.312469  1.000000  0.056325 -0.027825  0.082660  0.244265       NaN
age      -0.592451  0.056325  1.000000 -0.349269 -0.195590  0.277276  0.131111
sibsp     0.060832 -0.027825 -0.349269  1.000000  0.373587  0.160238 -0.099961
parch     0.018322  0.082660 -0.195590  0.373587  1.000000  0.221539  0.051099
fare     -0.558629  0.244265  0.277276  0.160238  0.221539  1.000000 -0.043110
body     -0.034642       NaN  0.131111 -0.099961  0.051099 -0.043110  1.000000

In [30]:
#대체값을 찾기 위해 연령을 범주화해보겠음

import warnings
warnings.filterwarnings('ignore')
from sklearn.preprocessing import LabelEncoder

le=LabelEncoder()
tit4['age_c_l']=le.fit_transform(tit4[['age_c']])
tit4.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,cabin_category,age_c,age_c_l
0,3,0,"Abbing, Mr. Anthony",male,27.61,0,0,C.A. 5547,7.55,NaN,S,NaN,NaN,NaN,Abbing,20대,1
1,3,0,"Abbott, Master. Eugene Joseph",male,22.39,0,2,C.A. 2673,20.25,NaN,S,NaN,NaN,"East Providence, RI",Abbott,20대,1
2,3,0,"Abbott, Mr. Rossmore Edward",male,16.75,1,1,C.A. 2673,20.25,NaN,S,NaN,190.0,"East Providence, RI",Abbott,10대,0
3,3,1,"Abbott, Mrs. Stanton (Rosa Hunt)",female,16.75,1,1,C.A. 2673,20.25,NaN,S,A,NaN,"East Providence, RI",Abbott,10대,0
4,3,1,"Abelseth, Miss. Karen Marie",female,27.61,0,0,348125,7.65,NaN,S,16,NaN,"Norway Los Angeles, CA",Abelseth_0,20대,1

In [31]:
tit4.corr()

#오히려 낮아진것을 확인할 수 있음

,pclass,survived,age,sibsp,parch,fare,body,age_c_l
pclass,1.000000,-0.312469,-0.592451,0.060832,0.018322,-0.558629,-0.034642,-0.459438
survived,-0.312469,1.000000,0.056325,-0.027825,0.082660,0.244265,NaN,0.157906
age,-0.592451,0.056325,1.000000,-0.349269,-0.195590,0.277276,0.131111,0.093434
sibsp,0.060832,-0.027825,-0.349269,1.000000,0.373587,0.160238,-0.099961,0.134165
parch,0.018322,0.082660,-0.195590,0.373587,1.000000,0.221539,0.051099,0.191738
fare,-0.558629,0.244265,0.277276,0.160238,0.221539,1.000000,-0.043110,0.236282
body,-0.034642,NaN,0.131111,-0.099961,0.051099,-0.043110,1.000000,0.030626
age_c_l,-0.459438,0.157906,0.093434,0.134165,0.191738,0.236282,0.030626,1.000000

In [32]:
#삭제
tit5=tit4.drop(['body','age_c_l'],axis=1)
tit5.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,home.dest,cabin_category,age_c
0,3,0,"Abbing, Mr. Anthony",male,27.61,0,0,C.A. 5547,7.55,NaN,S,NaN,NaN,Abbing,20대
1,3,0,"Abbott, Master. Eugene Joseph",male,22.39,0,2,C.A. 2673,20.25,NaN,S,NaN,"East Providence, RI",Abbott,20대
2,3,0,"Abbott, Mr. Rossmore Edward",male,16.75,1,1,C.A. 2673,20.25,NaN,S,NaN,"East Providence, RI",Abbott,10대
3,3,1,"Abbott, Mrs. Stanton (Rosa Hunt)",female,16.75,1,1,C.A. 2673,20.25,NaN,S,A,"East Providence, RI",Abbott,10대
4,3,1,"Abelseth, Miss. Karen Marie",female,27.61,0,0,348125,7.65,NaN,S,16,"Norway Los Angeles, CA",Abelseth_0,20대

#### boat 변수:  null값 삭제

In [33]:
tit5.isnull().sum()

#null값이 너무 많음

pclass               0
survived             0
name                 0
sex                  0
age                  0
sibsp                0
parch                0
ticket               0
fare                 1
cabin             1014
embarked             2
boat               823
home.dest          564
cabin_category       0
age_c                0
dtype: int64

In [34]:
tit5.boat.unique()

array([nan, 'A', '16', '10', '15', 'C', '11', '13', '2', '3', 'D', '4',
       '9', '6', 'B', '8', '5', '12', '7', '14', '13 15 B', '5 9', '1',
       'C D', '15 16', '5 7', '13 15', '8 10'], dtype=object)

In [35]:
tit5[tit5['boat']=='15 16']

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,home.dest,cabin_category,age_c
768,3,1,"McCarthy, Miss. Catherine ""Katie""",female,27.61,0,0,383123,7.75,NaN,Q,15 16,NaN,McCarthy_1,20대

In [36]:
tit5[tit5['boat']=='5']

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,home.dest,cabin_category,age_c
110,1,1,"Beckwith, Mr. Richard Leonard",male,37.00,1,1,11751,52.5542,D35,S,5,"New York, NY",Beckwith,30대
111,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.00,1,1,11751,52.5542,D35,S,5,"New York, NY",Beckwith,40대
113,1,1,"Behr, Mr. Karl Howell",male,40.49,0,0,111369,30.0000,C148,C,5,"New York, NY",Behr,40대
183,1,1,"Calderhead, Mr. Edward Pennington",male,40.49,0,0,PC 17476,26.2875,E24,S,5,"New York, NY",Calderhead,40대
215,1,1,"Cassebeer, Mrs. Henry Arthur Jr (Eleanor Genev...",female,40.49,0,0,17770,27.7208,NaN,C,5,"New York, NY",Cassebeer,40대
221,1,1,"Chambers, Mr. Norman Campbell",male,38.73,1,0,113806,53.1000,E8,S,5,"New York, NY / Ithaca, NY",Chambers,30대
222,1,1,"Chambers, Mrs. Norman Campbell (Bertha Griggs)",female,38.73,1,0,113806,53.1000,E8,S,5,"New York, NY / Ithaca, NY",Chambers,30대
334,1,1,"Dodge, Master. Washington",male,4.00,0,2,33638,81.8583,A34,S,5,"San Francisco, CA",Dodge,baby
335,1,1,"Dodge, Mrs. Washington (Ruth Vidaver)",female,54.00,1,1,33638,81.8583,A34,S,5,"San Francisco, CA",Dodge,50대
391,1,1,"Flynn, Mr. John Irwin (""Irving"")",male,40.49,0,0,PC 17474,26.3875,E25,S,5,"Brooklyn, NY",Flynn_0,40대
413,1,1,"Frauenthal, Dr. Henry William",male,50.00,2,0,PC 17611,133.6500,NaN,S,5,"New York, NY",Frauenthal_0,50대
414,1,1,"Frauenthal, Mr. Isaac Gerald",male,38.73,1,0,17765,27.7208,D40,C,5,"New York, NY",Frauenthal_1,30대
415,1,1,"Frauenthal, Mrs. Henry William (Clara Heinshei...",female,38.73,1,0,PC 17611,133.6500,NaN,S,5,"New York, NY",Frauenthal_0,30대
416,1,1,"Frolicher, Miss. Hedwig Margaritha",female,22.00,0,2,13568,49.5000,B39,C,5,"Zurich, Switzerland",Frolicher,20대
417,1,1,"Frolicher-Stehli, Mr. Maxmillian",male,60.00,1,1,13567,79.2000,B41,C,5,"Zurich, Switzerland",Frolicher-Stehli,60대
418,1,1,"Frolicher-Stehli, Mrs. Maxmillian (Margaretha ...",female,48.00,1,1,13567,79.2000,B41,C,5,"Zurich, Switzerland",Frolicher-Stehli,40대
448,1,1,"Goldenberg, Mr. Samuel L",male,38.73,1,0,17453,89.1042,C92,C,5,"Paris, France / New York, NY",Goldenberg,30대
449,1,1,"Goldenberg, Mrs. Samuel L (Edwiga Grabowska)",female,38.73,1,0,17453,89.1042,C92,C,5,"Paris, France / New York, NY",Goldenberg,30대
495,1,1,"Harder, Mr. George Achilles",male,38.73,1,0,11765,55.4417,E50,C,5,"Brooklyn, NY",Harder,30대
496,1,1,"Harder, Mrs. George Achilles (Dorothy Annan)",female,38.73,1,0,11765,55.4417,E50,C,5,"Brooklyn, NY",Harder,30대
651,1,1,"Kimball, Mr. Edwin Nelson Jr",male,38.73,1,0,11753,52.5542,D19,S,5,"Boston, MA",Kimball,30대
652,1,1,"Kimball, Mrs. Edwin Nelson Jr (Gertrude Parsons)",female,38.73,1,0,11753,52.5542,D19,S,5,"Boston, MA",Kimball,30대
860,1,1,"Newsom, Miss. Helen Monypeny",female,19.00,0,2,11752,26.2833,D47,S,5,"New York, NY",Newsom,10대
908,1,1,"Ostby, Miss. Helene Ragnhild",female,36.77,0,1,113509,61.9792,B36,C,5,"Providence, RI",Ostby,30대
1090,1,1,"Silverthorne, Mr. Spencer Victor",male,40.49,0,0,PC 17475,26.2875,E24,S,5,"St Louis, MO",Silverthorne,40대
1143,1,1,"Stengel, Mrs. Charles Emil Henry (Annie May Mo...",female,38.73,1,0,11778,55.4417,C116,C,5,"Newark, NJ",Stengel,30대
1235,1,1,"Warren, Mrs. Frank Manley (Anna Sophia Atkinson)",female,38.73,1,0,110813,75.2500,D37,C,5,"Portland, OR",Warren_1,30대

In [37]:
tit5[tit5['boat']=='16']

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,home.dest,cabin_category,age_c
4,3,1,"Abelseth, Miss. Karen Marie",female,27.61,0,0,348125,7.6500,NaN,S,16,"Norway Los Angeles, CA",Abelseth_0,20대
29,3,1,"Andersen-Jensen, Miss. Carla Christine Nielsine",female,26.45,1,0,350046,7.8542,NaN,S,16,NaN,Andersen-Jensen,20대
203,3,1,"Carr, Miss. Helen ""Ellen""",female,27.61,0,0,367231,7.7500,NaN,Q,16,"Co Longford, Ireland New York, NY",Carr_1,20대
314,3,1,"Davison, Mrs. Thomas Henry (Mary E Finck)",female,26.45,1,0,386525,16.1000,NaN,S,16,"Liverpool, England Bedford, OH",Davison,20대
360,3,1,"Dyker, Mrs. Adolf Fredrik (Anna Elisabeth Judi...",female,26.45,1,0,347072,13.9000,NaN,S,16,"West Haven, CT",Dyker,20대
382,2,1,"Faunthorpe, Mrs. Lizzie (Elizabeth Anne Wilkin...",female,29.00,1,0,2926,26.0000,NaN,S,16,NaN,Faunthorpe,20대
445,3,1,"Gilnagh, Miss. Katherine ""Katie""",female,27.61,0,0,35851,7.7333,NaN,Q,16,"Co Longford, Ireland New York, NY",Gilnagh,20대
520,3,1,"Healy, Miss. Hanora ""Nora""",female,27.61,0,0,370375,7.7500,NaN,Q,16,NaN,Healy,20대
637,3,1,"Kelly, Miss. Anna Katherine ""Annie Kate""",female,27.61,0,0,9234,7.7500,NaN,Q,16,NaN,Kelly_1,20대
755,3,1,"Mannion, Miss. Margareth",female,27.61,0,0,36866,7.7375,NaN,Q,16,NaN,Mannion,20대
771,3,1,"McCoy, Miss. Agnes",female,25.00,2,0,367226,23.2500,NaN,Q,16,NaN,McCoy,20대
772,3,1,"McCoy, Miss. Alicia",female,25.00,2,0,367226,23.2500,NaN,Q,16,NaN,McCoy,20대
773,3,1,"McCoy, Mr. Bernard",male,25.00,2,0,367226,23.2500,NaN,Q,16,NaN,McCoy,20대
810,3,1,"Mockler, Miss. Helen Mary ""Ellie""",female,27.61,0,0,330980,7.8792,NaN,Q,16,NaN,Mockler,20대
818,3,1,"Moran, Miss. Bertha",female,26.45,1,0,371110,24.1500,NaN,Q,16,NaN,Moran_0,20대
832,3,1,"Mullens, Miss. Katherine ""Katie""",female,27.61,0,0,35852,7.7333,NaN,Q,16,NaN,Mullens,20대
835,3,1,"Murphy, Miss. Katherine ""Kate""",female,26.45,1,0,367230,15.5000,NaN,Q,16,NaN,Murphy_0,20대
836,3,1,"Murphy, Miss. Margaret Jane",female,26.45,1,0,367230,15.5000,NaN,Q,16,NaN,Murphy_0,20대
837,3,1,"Murphy, Miss. Nora",female,27.61,0,0,36568,15.5000,NaN,Q,16,NaN,Murphy_1,20대
1089,2,1,"Silven, Miss. Lyyli Karoliina",female,18.00,0,2,250652,13.0000,NaN,S,16,"Finland / Minneapolis, MN",Silven,10대
1101,3,1,"Sjoblom, Miss. Anna Sofia",female,27.61,0,0,3101265,7.4958,NaN,S,16,NaN,Sjoblom,20대
1177,3,1,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C,16,NaN,Thomas_3,baby
1200,2,1,"Troutt, Miss. Edwina Celia ""Winnie""",female,32.22,0,0,34218,10.5000,E101,S,16,"Bath, England / Massachusetts",Troutt,30대

In [38]:
#규칙성이 보이지 않아 삭제

tit6=tit5.drop('boat',axis=1)
tit6.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,home.dest,cabin_category,age_c
0,3,0,"Abbing, Mr. Anthony",male,27.61,0,0,C.A. 5547,7.55,NaN,S,NaN,Abbing,20대
1,3,0,"Abbott, Master. Eugene Joseph",male,22.39,0,2,C.A. 2673,20.25,NaN,S,"East Providence, RI",Abbott,20대
2,3,0,"Abbott, Mr. Rossmore Edward",male,16.75,1,1,C.A. 2673,20.25,NaN,S,"East Providence, RI",Abbott,10대
3,3,1,"Abbott, Mrs. Stanton (Rosa Hunt)",female,16.75,1,1,C.A. 2673,20.25,NaN,S,"East Providence, RI",Abbott,10대
4,3,1,"Abelseth, Miss. Karen Marie",female,27.61,0,0,348125,7.65,NaN,S,"Norway Los Angeles, CA",Abelseth_0,20대

#### home.dest 변수 삭제

In [39]:
tit7=tit6.drop('home.dest',axis=1)
tit7.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,cabin_category,age_c
0,3,0,"Abbing, Mr. Anthony",male,27.61,0,0,C.A. 5547,7.55,NaN,S,Abbing,20대
1,3,0,"Abbott, Master. Eugene Joseph",male,22.39,0,2,C.A. 2673,20.25,NaN,S,Abbott,20대
2,3,0,"Abbott, Mr. Rossmore Edward",male,16.75,1,1,C.A. 2673,20.25,NaN,S,Abbott,10대
3,3,1,"Abbott, Mrs. Stanton (Rosa Hunt)",female,16.75,1,1,C.A. 2673,20.25,NaN,S,Abbott,10대
4,3,1,"Abelseth, Miss. Karen Marie",female,27.61,0,0,348125,7.65,NaN,S,Abelseth_0,20대

#### fare 변수 null값 대체

In [40]:
tit7.isnull().sum()

pclass               0
survived             0
name                 0
sex                  0
age                  0
sibsp                0
parch                0
ticket               0
fare                 1
cabin             1014
embarked             2
cabin_category       0
age_c                0
dtype: int64

In [41]:
tit7.corr()

#pclass, survived 변수들과 상관성이 어느정도 나타남

            pclass  survived       age     sibsp     parch      fare
pclass    1.000000 -0.312469 -0.592451  0.060832  0.018322 -0.558629
survived -0.312469  1.000000  0.056325 -0.027825  0.082660  0.244265
age      -0.592451  0.056325  1.000000 -0.349269 -0.195590  0.277276
sibsp     0.060832 -0.027825 -0.349269  1.000000  0.373587  0.160238
parch     0.018322  0.082660 -0.195590  0.373587  1.000000  0.221539
fare     -0.558629  0.244265  0.277276  0.160238  0.221539  1.000000

In [42]:
#피벗테이블을 이용해 좌석등급별, 생존여부별 fare의 평균값, 최소값, 최댓값 구하기

fare_p=pd.pivot_table(tit7, index='pclass', columns='survived',values='fare',aggfunc=['mean','min','max','count'])
fare_p

#특이하게도, 좌석등급이 높아도 최소값이 0임.

               mean             min           max           count
survived          0          1    0     1       0         1     0    1
pclass
1         70.412533  98.023314  0.0   0.0  263.00  512.3292   123  200
2         19.801713  23.008124  0.0  10.5   73.50   65.0000   158  119
3         13.435451  12.916919  0.0   0.0   69.55   56.4958   527  181

In [43]:
#데이터 살펴보기

tit7[tit7['fare']<7]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,cabin_category,age_c
46,1,0,"Andrews, Mr. Thomas Jr",male,40.49,0,0,112050,0.0000,A36,S,Andrews_0,40대
119,3,0,"Betros, Mr. Tannous",male,27.61,0,0,2648,4.0125,NaN,C,Betros_0,20대
170,3,0,"Burke, Mr. Jeremiah",male,27.61,0,0,365222,6.7500,NaN,Q,Burke,20대
190,2,0,"Campbell, Mr. William",male,32.22,0,0,239853,0.0000,NaN,S,Campbell,30대
202,1,0,"Carlsson, Mr. Frans Olof",male,40.49,0,0,695,5.0000,B51 B53 B55,S,Carlsson_1,40대
232,1,0,"Chisholm, Mr. Roderick Robert Crispin",male,40.49,0,0,112051,0.0000,NaN,S,Chisholm,40대
288,2,0,"Cunningham, Mr. Alfred Fleming",male,32.22,0,0,239853,0.0000,NaN,S,Cunningham,30대
293,3,1,"Daly, Miss. Margaret Marcella ""Maggie""",female,27.61,0,0,382650,6.9500,NaN,Q,Daly_0,20대
365,3,0,"Ekstrom, Mr. Johan",male,27.61,0,0,347061,6.9750,NaN,S,Ekstrom,20대
390,3,0,"Flynn, Mr. John",male,27.61,0,0,368323,6.9500,NaN,Q,Flynn_2,20대
419,2,0,"Frost, Mr. Anthony Wood ""Archie""",male,32.22,0,0,239854,0.0000,NaN,S,Frost,30대
420,1,0,"Fry, Mr. Richard",male,40.49,0,0,112058,0.0000,B102,S,Fry,40대
508,1,0,"Harrison, Mr. William",male,40.49,0,0,112059,0.0000,B94,S,Harrison,40대
511,3,0,"Hart, Mr. Henry",male,27.61,0,0,394140,6.8583,NaN,Q,Hart_1,20대
521,3,1,"Hedman, Mr. Oskar Arvid",male,27.61,0,0,347089,6.9750,NaN,S,Hedman,20대
523,3,0,"Hegarty, Miss. Hanora ""Nora""",female,27.61,0,0,365226,6.7500,NaN,Q,Hegarty,20대
553,3,0,"Holm, Mr. John Fredrik Alexander",male,27.61,0,0,C 7075,6.4500,NaN,S,Holm,20대
578,1,1,"Ismay, Mr. Joseph Bruce",male,40.49,0,0,112058,0.0000,B52 B54 B56,S,Ismay,40대
595,3,0,"Johanson, Mr. Jakob Alfred",male,27.61,0,0,3101264,6.4958,NaN,S,Johanson,20대
603,3,0,"Johnson, Mr. Alfred",male,27.61,0,0,LINE,0.0000,NaN,S,Johnson_2,20대
605,3,0,"Johnson, Mr. William Cahoone Jr",male,27.61,0,0,LINE,0.0000,NaN,S,Johnson_2,20대
663,2,0,"Knight, Mr. Robert J",male,32.22,0,0,239855,0.0000,NaN,S,Knight,30대
697,3,0,"Lemberopolous, Mr. Peter L",male,27.61,0,0,2683,6.4375,NaN,C,Lemberopolous,20대
701,3,0,"Leonard, Mr. Lionel",male,27.61,0,0,LINE,0.0000,NaN,S,Leonard,20대
878,3,0,"Nysveen, Mr. Johan Hansen",male,27.61,0,0,345364,6.2375,NaN,S,Nysveen,20대
894,3,1,"Olsen, Master. Artur Karl",male,9.00,0,1,C 17368,3.1708,NaN,S,Olsen_0,baby
928,2,0,"Parkes, Mr. Francis ""Frank""",male,32.22,0,0,239853,0.0000,NaN,S,Parkes,30대
929,1,0,"Parr, Mr. William Henry Marsh",male,40.49,0,0,112052,0.0000,NaN,S,Parr,40대
990,1,0,"Reuchlin, Jonkheer. John George",male,40.49,0,0,19972,0.0000,NaN,S,Reuchlin,40대
1178,3,0,"Thomas, Mr. Charles P",male,26.45,1,0,2621,6.4375,NaN,C,Thomas_0,20대
1179,3,0,"Thomas, Mr. John",male,27.61,0,0,2681,6.4375,NaN,C,Thomas_2,20대
1193,3,1,"Tornquist, Mr. William Henry",male,27.61,0,0,LINE,0.0000,NaN,S,Tornquist,20대
1236,2,0,"Watson, Mr. Ennis Hastings",male,32.22,0,0,239856,0.0000,NaN,S,Watson,30대
1265,3,0,"Wiklund, Mr. Jakob Alfred",male,26.45,1,0,3101267,6.4958,NaN,S,Wiklund_1,20대
1266,3,0,"Wiklund, Mr. Karl Johan",male,26.45,1,0,3101266,6.4958,NaN,S,Wiklund_0,20대

In [44]:
#등급별,생존여부 boxplot 그려보기
grouped_ps=tit7.groupby(['pclass','survived'])
grouped_ps

In [45]:


sns.boxplot(,'fare',data=tit7)

SyntaxError: invalid syntax (1381600770.py, line 1)

In [ ]:
#범주화 후 labelencoding

from sklearn.preprocessing import LabelEncoder

le=LabelEncoder()

In [ ]:
tit_f.loc[tit_f['fare'].isnull()]

In [ ]:
tit_f.loc[tit_f['pclass']==3,'fare'].mean()

In [ ]:
tit_f=tit7.copy()

tit_f.sex=tit_f.sex.replace(['male','female'],[0,1])
tit_f['cabin_c']=le.fit_transform(tit_f[['cabin_category']])
tit_f['embarked']=le.fit_transform(tit_f[['embarked']])
tit_f['embarked']=tit_f['embarked'].fillna(method='ffill')
tit_f.loc[tit_f['fare'].isnull(),'fare']=tit_f.loc[tit_f['pclass']==3,'fare'].mean()

tit_f.head()
tit_f.isnull().sum()

In [ ]:
tit_f=tit7.copy()

tit_f.sex=tit_f.sex.replace(['male','female'],[0,1])
tit_f.loc[tit_f['fare'].isnull(),'fare']=tit_f.loc[tit_f['pclass']==3,'fare'].mean()


tit_f['embarked']=tit_f['embarked'].fillna(method='ffill')
tit_f=pd.get_dummies(tit_f[['cabin_category','embarked']])



tit_f.head()
tit_f.isnull().sum()

## 2. 분석용 데이터셋 준비

In [ ]:
from sklearn import preprocessing
from sklearn.model_selection import train_test_split


#독립변수, 종속변수 분리(변수는 바꿔도 됨!)
X = tit_f[['pclass', 'sex', 'age', 'sibsp', 'parch', 'fare', 'cabin_c', 'embarked']]
y = tit_f['survived']

# 학습용 테이터와 평가용 데이터를 8:2로 분리
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, \
                                                    random_state=10) 
print(X_train.shape)
print(X_test.shape)

## 3. 모델링 및 평가

In [ ]:
# Decision Tree
from sklearn.metrics import accuracy_score
from sklearn.tree import DecisionTreeClassifier
dt_model = DecisionTreeClassifier()
dt_model.fit(X_train, y_train)
dt_pred = dt_model.predict(X_test)

print(dt_pred[0:10])
print(y_test.values[0:10])

accuracy = accuracy_score(y_test, dt_pred)
print('dt 예측 정확도 :', accuracy)

In [ ]:
# Random Forest
from sklearn.ensemble import RandomForestClassifier

rf_model = RandomForestClassifier()
rf_model.fit(X_train, y_train)
rf_pred = rf_model.predict(X_test)

rf_accuracy = accuracy_score(y_test, rf_pred)
print('rf 예측 정확도 :', rf_accuracy)

In [ ]:
# Logistic Regression
import warnings
warnings.filterwarnings('ignore')
from sklearn.linear_model import LogisticRegression

lr_model = LogisticRegression(random_state=0)
lr_model.fit(X_train,y_train)
lr_pred = lr_model.predict(X_test)

lr_accuracy = accuracy_score(y_test, lr_pred)
print('lr 예측 정확도 :', accuracy)